Parameters:
  PslistRows: /testcases/fixtures/macos_pslist_process.json
  SigmaRule: |
    title: Base64 Decode Detected
    status: test
    logsource:
      category: process_creation
      product: macos
    detection:
      selection:
        Image|endswith: '/base64'
        CommandLine|contains: '-d'
      condition: selection
    level: critical

Queries:
- LET _ <= SELECT mock(plugin='info', results=[dict(Hostname="test-mac.local", OS="darwin"),]) FROM scope()

- LET _ <= SELECT mock(plugin='pslist', results=parse_json_array(data=read_file(filename=testDir + PslistRows))) FROM scope()

- SELECT * FROM Artifact.MacOS.Sigma.BaseVQL(SigmaRules=SigmaRule, RuleLevel='All', RuleStatus='All Rules') LIMIT 1
